### Question:
Importing Xlsx ðŸ†•
- Print the sheetnames of the Excel spreadsheet by passing the necessary argument to the print() function.
- Parse the first sheet by index. In doing so, skip the first row of data and name the columns 'Country' and 'AAM due to War (2002)' using the argument names. The values passed to skiprows and names all need to be of type list.
- Parse the second sheet by index. In doing so, parse only the first column with the usecols parameter, skip the first row and rename the column 'Country'. The argument passed to usecols also needs to be of type list.
- Load the sheet '2004' into the DataFrame df1 using its name as a string. Print the head of df1 to the shell.

In [1]:
# importing library
import pandas as pd

In [2]:
file = 'datasets/battledeath.xlsx'

In [5]:
data = pd.ExcelFile(file)
print(f'Sheet names of excel file:\n',data.sheet_names)

Sheet names of excel file:
 ['2002', '2004']

In [52]:
df = data.parse(0)
df

    War, age-adjusted mortality due to       2002
0                          Afghanistan  36.083990
1                              Albania   0.128908
2                              Algeria  18.314120
3                              Andorra   0.000000
4                               Angola  18.964560
..                                 ...        ...
187                          Venezuela   0.000000
188                            Vietnam   0.040222
189                        Yemen, Rep.   0.074510
190                             Zambia   0.044548
191                           Zimbabwe  33.796200

[192 rows x 2 columns]

In [47]:
df = data.parse(0, skiprows=[0], names=["Country", "AAM due to War (2002)"])
print(df)

                 Country  AAM due to War (2002)
0                Albania               0.128908
1                Algeria              18.314120
2                Andorra               0.000000
3                 Angola              18.964560
4    Antigua and Barbuda               0.000000
..                   ...                    ...
186            Venezuela               0.000000
187              Vietnam               0.040222
188          Yemen, Rep.               0.074510
189               Zambia               0.044548
190             Zimbabwe              33.796200

[191 rows x 2 columns]

In [58]:
df2 = data.parse(1, skiprows=[0] , usecols=[0] , names=["Country"])
df2

                 Country
0                Albania
1                Algeria
2                Andorra
3                 Angola
4    Antigua and Barbuda
..                   ...
186            Venezuela
187              Vietnam
188          Yemen, Rep.
189               Zambia
190             Zimbabwe

[191 rows x 1 columns]

In [56]:
df1 = data.parse('2004')
df1.head()

  War(country)      2004
0  Afghanistan  9.451028
1      Albania  0.130354
2      Algeria  3.407277
3      Andorra  0.000000
4       Angola  2.597931